{"title": "Amplifying robotics capacities with a human touch: An immersive low-latency panoramic remote system", "summary": "AI and robotics technologies have witnessed remarkable advancements in the\npast decade, revolutionizing work patterns and opportunities in various\ndomains. The application of these technologies has propelled society towards an\nera of symbiosis between humans and machines. To facilitate efficient\ncommunication between humans and intelligent robots, we propose the \"Avatar\"\nsystem, an immersive low-latency panoramic human-robot interaction platform. We\nhave designed and tested a prototype of a rugged mobile platform integrated\nwith edge computing units, panoramic video capture devices, power batteries,\nrobot arms, and network communication equipment. Under favorable network\nconditions, we achieved a low-latency high-definition panoramic visual\nexperience with a delay of 357ms. Operators can utilize VR headsets and\ncontrollers for real-time immersive control of robots and devices. The system\nenables remote control over vast physical distances, spanning campuses,\nprovinces, countries, and even continents (New York to Shenzhen). Additionally,\nthe system incorporates visual SLAM technology for map and trajectory\nrecording, providing autonomous navigation capabilities. We believe that this\nintuitive system platform can enhance efficiency and situational experience in\nhuman-robot collaboration, and with further advancements in related\ntechnologies, it will become a versatile tool for efficient and symbiotic\ncooperation between AI and humans.", "tags": ["AI", "robotics", "human-robot interaction", "immersive technology", "low-latency", "panoramic", "edge computing", "robotics arms", "network communication", "VR headsets", "remote control", "SLAM technology", "autonomous navigation", "AI and humans cooperation", "symbiosis", "collision detection", "machine learning (referenced but not explicitly mentioned)"], "citations": [], "date": "2024-01-07", "pdf_path": ""}