{"title": "Digital Twin of Autonomous Surface Vessels for Safe Maritime Navigation Enabled through Predictive Modeling and Reinforcement Learning", "summary": "Autonomous surface vessels (ASVs) play an increasingly important role in the\nsafety and sustainability of open sea operations. Since most maritime accidents\nare related to human failure, intelligent algorithms for autonomous collision\navoidance and path following can drastically reduce the risk in the maritime\nsector. A DT is a virtual representative of a real physical system and can\nenhance the situational awareness (SITAW) of such an ASV to generate optimal\ndecisions. This work builds on an existing DT framework for ASVs and\ndemonstrates foundations for enabling predictive, prescriptive, and autonomous\ncapabilities. In this context, sophisticated target tracking approaches are\ncrucial for estimating and predicting the position and motion of other dynamic\nobjects. The applied tracking method is enabled by real-time automatic\nidentification system (AIS) data and synthetic light detection and ranging\n(Lidar) measurements. To guarantee safety during autonomous operations, we\napplied a predictive safety filter, based on the concept of nonlinear model\npredictive control (NMPC). The approaches are implemented into a DT built with\nthe Unity game engine. As a result, this work demonstrates the potential of a\nDT capable of making predictions, playing through various what-if scenarios,\nand providing optimal control decisions according to its enhanced SITAW.", "tags": ["Autonomous Surface Vessels", "Artificial Intelligence", "Collision Avoidance", "Autonomous Path Following", "Situational Awareness", "Decision Trees (DT)", "Predictive Model", "Prescriptive Model", "Autonomy", "Target Tracking", "Sensor Data", "AIS (Automatic Identification System)", "Lidar (Light Detection and Ranging)", "NMPC (Nonlinear Model Predictive Control)", "Machine Learning", "Unity Game Engine"], "citations": [], "date": "2024-01-08", "pdf_path": ""}