{"title": "Effects of Multimodal Explanations for Autonomous Driving on Driving Performance, Cognitive Load, Expertise, Confidence, and Trust", "summary": "Advances in autonomous driving provide an opportunity for AI-assisted driving\ninstruction that directly addresses the critical need for human driving\nimprovement. How should an AI instructor convey information to promote\nlearning? In a pre-post experiment (n = 41), we tested the impact of an AI\nCoach's explanatory communications modeled after performance driving expert\ninstructions. Participants were divided into four (4) groups to assess two (2)\ndimensions of the AI coach's explanations: information type ('what' and\n'why'-type explanations) and presentation modality (auditory and visual). We\ncompare how different explanatory techniques impact driving performance,\ncognitive load, confidence, expertise, and trust via observational learning.\nThrough interview, we delineate participant learning processes. Results show AI\ncoaching can effectively teach performance driving skills to novices. We find\nthe type and modality of information influences performance outcomes.\nDifferences in how successfully participants learned are attributed to how\ninformation directs attention, mitigates uncertainty, and influences overload\nexperienced by participants. Results suggest efficient, modality-appropriate\nexplanations should be opted for when designing effective HMI communications\nthat can instruct without overwhelming. Further, results support the need to\nalign communications with human learning and cognitive processes. We provide\neight design implications for future autonomous vehicle HMI and AI coach\ndesign.", "tags": ["autonomous driving", "AI-assisted driving instruction", "human-computer interaction", "HMI", "human learning", "cognitive processes", "AI coach", "performance driving", "expert instructions", "explanatory techniques", "information type", "presentation modality", "auditory", "visual", "observational learning", "novices", "participant learning processes", "confidence", "expertise", "trust", "cognitive load", "design implications", "machine learning", "computer vision", "interview", "pre-post experiment"], "citations": [], "date": "2024-01-08", "pdf_path": ""}