{"title": "HAIM-DRL: Enhanced Human-in-the-loop Reinforcement Learning for Safe and Efficient Autonomous Driving", "summary": "Despite significant progress in autonomous vehicles (AVs), the development of\ndriving policies that ensure both the safety of AVs and traffic flow efficiency\nhas not yet been fully explored. In this paper, we propose an enhanced\nhuman-in-the-loop reinforcement learning method, termed the Human as AI\nmentor-based deep reinforcement learning (HAIM-DRL) framework, which\nfacilitates safe and efficient autonomous driving in mixed traffic platoon.\nDrawing inspiration from the human learning process, we first introduce an\ninnovative learning paradigm that effectively injects human intelligence into\nAI, termed Human as AI mentor (HAIM). In this paradigm, the human expert serves\nas a mentor to the AI agent. While allowing the agent to sufficiently explore\nuncertain environments, the human expert can take control in dangerous\nsituations and demonstrate correct actions to avoid potential accidents. On the\nother hand, the agent could be guided to minimize traffic flow disturbance,\nthereby optimizing traffic flow efficiency. In detail, HAIM-DRL leverages data\ncollected from free exploration and partial human demonstrations as its two\ntraining sources. Remarkably, we circumvent the intricate process of manually\ndesigning reward functions; instead, we directly derive proxy state-action\nvalues from partial human demonstrations to guide the agents' policy learning.\nAdditionally, we employ a minimal intervention technique to reduce the human\nmentor's cognitive load. Comparative results show that HAIM-DRL outperforms\ntraditional methods in driving safety, sampling efficiency, mitigation of\ntraffic flow disturbance, and generalizability to unseen traffic scenarios. The\ncode and demo videos for this paper can be accessed at:\nhttps://zilin-huang.github.io/HAIM-DRL-website/", "tags": ["autonomous vehicles", "reinforcement learning", "deep learning", "human-in-the-loop", "traffic flow efficiency", "mixed traffic platoon", "human intelligence", "AI mentorship", "expert system", "driver safety", "sampling efficiency", "traffic disturbance mitigation", "generalizability", "traffic scenarios", "road safety"], "citations": [], "date": "2024-01-06", "pdf_path": ""}