{"title": "Modern Computing: Vision and Challenges", "summary": "Over the past six decades, the computing systems field has experienced\nsignificant transformations, profoundly impacting society with transformational\ndevelopments, such as the Internet and the commodification of computing.\nUnderpinned by technological advancements, computer systems, far from being\nstatic, have been continuously evolving and adapting to cover multifaceted\nsocietal niches. This has led to new paradigms such as cloud, fog, edge\ncomputing, and the Internet of Things (IoT), which offer fresh economic and\ncreative opportunities. Nevertheless, this rapid change poses complex research\nchallenges, especially in maximizing potential and enhancing functionality. As\nsuch, to maintain an economical level of performance that meets ever-tighter\nrequirements, one must understand the drivers of new model emergence and\nexpansion, and how contemporary challenges differ from past ones. To that end,\nthis article investigates and assesses the factors influencing the evolution of\ncomputing systems, covering established systems and architectures as well as\nnewer developments, such as serverless computing, quantum computing, and\non-device AI on edge devices. Trends emerge when one traces technological\ntrajectory, which includes the rapid obsolescence of frameworks due to business\nand technical constraints, a move towards specialized systems and models, and\nvarying approaches to centralized and decentralized control. This comprehensive\nreview of modern computing systems looks ahead to the future of research in the\nfield, highlighting key challenges and emerging trends, and underscoring their\nimportance in cost-effectively driving technological progress.", "tags": ["computer systems", "computing", "artificial intelligence", "serverless computing", "quantum computing", "on-device AI", "edge computing", "Internet of Things", "cloud computing", "fog computing", "IoT", "research", "future of computing", "computer architectures", "technological progress", "evolution of computing", "technological advancements", "computational models", "specialized systems", "decentralized control", "centralized control"], "citations": [], "date": "2024-01-04", "pdf_path": ""}