{"title": "Nurse-in-the-Loop Artificial Intelligence for Precision Management of Type 2 Diabetes in a Clinical Trial Utilizing Transfer-Learned Predictive Digital Twin", "summary": "Background: Type 2 diabetes (T2D) is a prevalent chronic disease with a\nsignificant risk of serious health complications and negative impacts on the\nquality of life. Given the impact of individual characteristics and lifestyle\non the treatment plan and patient outcomes, it is crucial to develop precise\nand personalized management strategies. Artificial intelligence (AI) provides\ngreat promise in combining patterns from various data sources with nurses'\nexpertise to achieve optimal care. Methods: This is a 6-month ancillary study\namong T2D patients (n = 20, age = 57 +- 10). Participants were randomly\nassigned to an intervention (AI, n=10) group to receive daily AI-generated\nindividualized feedback or a control group without receiving the daily feedback\n(non-AI, n=10) in the last three months. The study developed an online\nnurse-in-the-loop predictive control (ONLC) model that utilizes a predictive\ndigital twin (PDT). The PDT was developed using a transfer-learning-based\nArtificial Neural Network. The PDT was trained on participants self-monitoring\ndata (weight, food logs, physical activity, glucose) from the first three\nmonths, and the online control algorithm applied particle swarm optimization to\nidentify impactful behavioral changes for maintaining the patient's glucose and\nweight levels for the next three months. The ONLC provided the intervention\ngroup with individualized feedback and recommendations via text messages. The\nPDT was re-trained weekly to improve its performance. Findings: The trained\nONLC model achieved >=80% prediction accuracy across all patients while the\nmodel was tuned online. Participants in the intervention group exhibited a\ntrend of improved daily steps and stable or improved total caloric and total\ncarb intake as recommended.", "tags": ["type 2 diabetes", "artificial intelligence", "machine learning", "personalized medicine", "digital twin", "predictive analytics", "particle swarm optimization", "artificial neural network", "transfer learning", "telehealth", "mobile health", "health informatics", "healthcare", "nurse-led care", "patient outcomes", "weight management", "glucose monitoring"], "citations": [], "date": "2024-01-05", "pdf_path": ""}