{"title": "Traffic Cameras to detect inland waterway barge traffic: An Application of machine learning", "summary": "Inland waterways are critical for freight movement, but limited means exist\nfor monitoring their performance and usage by freight-carrying vessels, e.g.,\nbarges. While methods to track vessels, e.g., tug and tow boats, are publicly\navailable through Automatic Identification Systems (AIS), ways to track freight\ntonnages and commodity flows carried on barges along these critical marine\nhighways are non-existent, especially in real-time settings. This paper\ndevelops a method to detect barge traffic on inland waterways using existing\ntraffic cameras with opportune viewing angles. Deep learning models,\nspecifically, You Only Look Once (YOLO), Single Shot MultiBox Detector (SSD),\nand EfficientDet are employed. The model detects the presence of vessels and/or\nbarges from video and performs a classification (no vessel or barge, vessel\nwithout barge, vessel with barge, and barge). A dataset of 331 annotated images\nwas collected from five existing traffic cameras along the Mississippi and Ohio\nRivers for model development. YOLOv8 achieves an F1-score of 96%, outperforming\nYOLOv5, SSD, and EfficientDet models with 86%, 79%, and 77% respectively.\nSensitivity analysis was carried out regarding weather conditions (fog and\nrain) and location (Mississippi and Ohio rivers). A background subtraction\ntechnique was used to normalize video images across the various locations for\nthe location sensitivity analysis. This model can be used to detect the\npresence of barges along river segments, which can be used for anonymous bulk\ncommodity tracking and monitoring. Such data is valuable for long-range\ntransportation planning efforts carried out by public transportation agencies,\nin addition to operational and maintenance planning conducted by federal\nagencies such as the US Army Corp of Engineers.", "tags": ["inland waterways", "freight movement", "barges", "video analysis", "deep learning", "YOLO", "SSD", "EfficientDet", "traffic cameras", "maritime traffic monitoring", "real-time tracking", "Mississippi River", "Ohio River", "public transportation planning", "US Army Corp of Engineers", "transportation planning", "maintenance planning", "bulk commodity tracking", "computer vision", "artificial intelligence", "image classification", "sensitivity analysis"], "citations": [], "date": "2024-01-05", "pdf_path": ""}