{"title": "XXAI: Towards eXplicitly eXplainable Artificial Intelligence", "summary": "There are concerns about the reliability and safety of artificial\nintelligence (AI) based on sub-symbolic neural networks because its decisions\ncannot be explained explicitly. This is the black box problem of modern AI. At\nthe same time, symbolic AI has the nature of a white box and is able to ensure\nthe reliability and safety of its decisions. However, several problems prevent\nthe widespread use of symbolic AI: the opacity of mathematical models and\nnatural language terms, the lack of a unified ontology, and the combinatorial\nexplosion of search capabilities. To solve the black-box problem of AI, we\npropose eXplicitly eXplainable AI (XXAI) - a fully transparent white-box AI\nbased on deterministic logical cellular automata whose rules are derived from\nthe first principles of the general theory of the relevant domain. In this\ncase, the general theory of the domain plays the role of a knowledge base for\nderiving the inferences of the cellular automata. A cellular automaton\nimplements parallel multi-level logical inference at all levels of organization\n- from local interactions of the element base to the system as a whole. Our\nverification of several ecological hypotheses sets a precedent for the\nsuccessful implementation of the proposed solution. XXAI is able to\nautomatically verify the reliability, security and ethics of sub-symbolic\nneural network solutions in both the final and training phases. In this\narticle, we present precedents for the successful implementation of XXAI, the\ntheoretical and methodological foundations for its further development, and\ndiscuss prospects for the future.", "tags": ["artificial intelligence", "AI", "black box problem", "symbolic AI", "neural networks", "eXplicitly eXplainable AI", "deterministic logical cellular automata", "verification", "reliability", "safety", "ethics", "parallel multi-level logical inference", "cellular automata", "machine learning", "natural language", "ontology", "combinatorial explosion", "knowledge base", "general theory", "domain theory"], "citations": [], "date": "2024-01-05", "pdf_path": ""}